app/views/users/dashboard.html.erb

    <%
      monit_system = MonitSystem.where(name: monit_host_config['monit_system_url']).first
---
SELECT  `monit_systems`.* FROM `monit_systems` WHERE `monit_systems`.`name` = 'sivas-MacBook-Air-2.local' ORDER BY `monit_systems`.`id` ASC LIMIT 1

          <thead>
             <% monit_instance.monit_processes.first.attributes.each do |key,value| %>
---
SELECT  `monit_processes`.* FROM `monit_processes` WHERE `monit_processes`.`monit_instance_id` = 1 ORDER BY `monit_processes`.`id` ASC LIMIT 1

            <% monit_host_config['monit_process_urls'].each do |monit_process_name| %>
              <% monit_process = monit_instance.monit_processes.where(name: monit_process_name).last %>
---
SELECT  `monit_processes`.* FROM `monit_processes` WHERE `monit_processes`.`monit_instance_id` = 1 AND `monit_processes`.`name` = 'mysqld' ORDER BY `monit_processes`.`id` DESC LIMIT 1

        </table>
        <%= pie_chart monit_instance.monit_processes.group(:name).count %>
        <%#= bar_chart monit_instance.monit_processes.group(:status).sum(:price) %>
        <%= column_chart monit_instance.monit_processes.group(:name, :status).count %>
---
SELECT  `monit_processes`.* FROM `monit_processes` WHERE `monit_processes`.`monit_instance_id` = 1 AND `monit_processes`.`name` = 'mysqld' ORDER BY `monit_processes`.`id` DESC LIMIT 1
SELECT COUNT(*) AS count_all, `monit_processes`.`name` AS monit_processes_name FROM `monit_processes` WHERE `monit_processes`.`monit_instance_id` = 1 GROUP BY `monit_processes`.`name`
SELECT COUNT(*) AS count_all, `monit_processes`.`status` AS monit_processes_status, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:%i:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second) AS date_add_convert_tz_date_format_convert_tz_date_sub_created_at_interval_0_second_00_00_etc_utc_y_m_d_h_i_00_etc_utc_00_00_interval_0_second FROM `monit_processes` WHERE `monit_processes`.`monit_instance_id` = 1 AND (created_at IS NOT NULL) GROUP BY `monit_processes`.`status`, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:%i:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second)
SELECT `monit_processes`.* FROM `monit_processes` WHERE `monit_processes`.`monit_instance_id` = 1 AND (created_at IS NOT NULL) GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:%i:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second)


        <%= line_chart MonitProcess.group(:name).group_by_minute(:created_at).count %>
---
SELECT COUNT(*) AS count_all, `monit_processes`.`name` AS monit_processes_name, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:%i:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second) AS date_add_convert_tz_date_format_convert_tz_date_sub_created_at_interval_0_second_00_00_etc_utc_y_m_d_h_i_00_etc_utc_00_00_interval_0_second FROM `monit_processes` WHERE (created_at IS NOT NULL) GROUP BY `monit_processes`.`name`, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:%i:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second)