app/views/users/show.html.erb

                                <%
                                    monit_system = MonitSystem.where(name: monit_host_config['monit_system_url']).first
---
SELECT  `monit_systems`.* FROM `monit_systems` WHERE `monit_systems`.`name` = 'sivas-MacBook-Air-2.local' ORDER BY `monit_systems`.`id` ASC LIMIT 1


                                                        <% monit_instance.monit_processes.first.attributes.each do |key,value| %>
---
SELECT  `monit_processes`.* FROM `monit_processes` WHERE `monit_processes`.`monit_instance_id` = 1 ORDER BY `monit_processes`.`id` ASC LIMIT 1

                                                        <%# monit_instance.monit_processes.each do |monit_process|%>
                                                        <% monit_process = monit_instance.monit_processes.where(name: monit_process_name).last %>
---
SELECT  `monit_processes`.* FROM `monit_processes` WHERE `monit_processes`.`monit_instance_id` = 1 AND `monit_processes`.`name` = 'mysqld' ORDER BY `monit_processes`.`id` DESC LIMIT 1