app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`) VALUES ('first_name', 'email', '2018-09-01 01:25:58', '2018-09-01 01:25:58')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save