app/models/monit_system.rb

SELECT `monit_systems`.* FROM `monit_systems` WHERE `monit_systems`.`name` = 'sivas-MacBook-Air-2.local'
INSERT INTO `monit_systems` (`name`, `status`, `monitoring_status`, `monitoring_mode`, `on_reboot`, `load_average`, `cpu`, `memory_usage`, `swap_usage`, `uptime`, `boot_time`, `data_collected`) VALUES ('sivas-MacBook-Air-2.local', 'OK', 'Monitored', 'active', 'start', '[3.43] [3.59] [3.48]', '34.2%us 11.6%sy', '3.8 GB [48.0%]', '2.6 GB [88.1%]', '6d 19h 33m', 'Sat, 25 Aug 2018 17:39:38', 'Sat, 01 Sep 2018 13:12:25')
---
	def self.scrape_and_create_system url=nil
		require 'nokogiri'
		require 'net/http'
		require 'openssl'

		uri = URI(url)
		monit_system_params = {}
		white_listed_params = self.column_names
		Net::HTTP.start(uri.host, uri.port, :verify_mode => OpenSSL::SSL::VERIFY_NONE) do |http|
		  request = Net::HTTP::Get.new uri.request_uri
		  request.basic_auth 'admin', 'monit'
		  response = http.request request
		  doc = Nokogiri::HTML(response.body)
			tables = doc.search('table')

			skip_tables = 2
			tables.search('tr').each_with_index do |row, index|
				next if index < skip_tables
			  cells = row.search('th, td').map { |cell| cell.text.strip }
			  parameter = cells[0].downcase.gsub(' ','_').gsub('/','_')
			  monit_system_params[parameter] = cells[1] if white_listed_params.include? parameter
			end
		end

		existing_monit_system = MonitSystem.where(name: monit_system_params['name'])
		if existing_monit_system.present?
			return existing_monit_system.first
		else
			return MonitSystem.create(monit_system_params)