app/models/monit_process.rb

	def self.scrape_and_create_monit_process url=nil, monit_instance_id=nil
		require 'nokogiri'
		require 'net/http'
		require 'openssl'

		uri = URI(url)
		monit_process_params = {}
		monit_process_params['monit_instance_id'] = monit_instance_id
		white_listed_params = self.column_names
		Net::HTTP.start(uri.host, uri.port, :verify_mode => OpenSSL::SSL::VERIFY_NONE) do |http|
		  request = Net::HTTP::Get.new uri.request_uri
		  request.basic_auth 'admin', 'monit'
		  response = http.request request
		  doc = Nokogiri::HTML(response.body)
			tables = doc.search('table')

			table = tables[1]
			table.search('tr').each do |row|
				cells = row.search('th, td').map{ |cell| cell.text.strip}
				parameter = cells[0].downcase.gsub(' ','_').gsub('/','_')
			  monit_process_params[parameter] = cells[1] if white_listed_params.include? parameter
			end
		end
		MonitProcess.create(monit_process_params)
---
INSERT INTO `monit_processes` (`name`, `pid_file`, `status`, `group`, `monitoring_status`, `monitoring_mode`, `on_reboot`, `pid`, `parent_pid`, `uid`, `effective_uid`, `gid`, `uptime`, `threads`, `children`, `cpu`, `cpu_total`, `memory`, `memory_total`, `data_collected`, `created_at`, `updated_at`, `monit_instance_id`) VALUES ('mysqld', '/usr/local/var/mysql/sivas-MacBook-Air-2.local.pid', 'OK', 'database', 'Monitored', 'active', 'start', 'If changed then exec \'/Users/noskillguy/monit/slack_notifications.sh\'', '29072', '501', '501', '20', '6d 15h 54m', '44', '0', '0.3%', '0.3%', '0.6% [45.3 MB]', '0.6% [45.3 MB]', 'Mon, 03 Sep 2018 11:26:49', '2018-09-03 05:57:04', '2018-09-03 05:57:04', 1)