app/models/monit_instance.rb

SELECT `monit_instances`.* FROM `monit_instances` WHERE `monit_instances`.`monit_id` = '89f0dd17d9b363ffda3dc80ef537d031'
INSERT INTO `monit_instances` (`monit_id`, `host`, `process_id`, `effective_user_running_monit`, `controlfile`, `logfile`, `pidfile`, `state_file`, `debug`, `log`, `use_syslog`, `limit_for_send_expect_buffer`, `limit_for_file_content_buffer`, `limit_for_http_content_buffer`, `limit_for_program_output`, `limit_for_network_timeout`, `limit_for_check_program_timeout`, `limit_for_service_stop_timeout`, `limit_for_service_start_timeout`, `limit_for_service_restart_timeout`, `on_reboot`, `poll_time`, `httpd_bind_address`, `httpd_portnumber`, `httpd_signature`, `created_at`, `updated_at`, `monit_system_id`) VALUES ('89f0dd17d9b363ffda3dc80ef537d031', 'sivas-MacBook-Air-2.local', '18786', 'noskillguy', '/Users/noskillguy/.monitrc', '/Users/noskillguy/monit.log', '/Users/noskillguy/.monit.pid', '/Users/noskillguy/.monit.state', 'False', 'True', 'False', '256 B', '512 B', '1 MB', '512 B', '5 s', '5 m', '30 s', '30 s', '30 s', 'start', '20 seconds with start delay 0 seconds', 'Any/All', '2812', 'True', '2018-09-03 05:57:04', '2018-09-03 05:57:04', 1)
---
	def self.scrape_and_create_monit url=nil, monit_system_id=nil, username, password
		require 'nokogiri'
		require 'net/http'
		require 'openssl'

		uri = URI(url)
		monit_instance_params = {}
		monit_instance_params['monit_system_id'] = monit_system_id
		white_listed_params = self.column_names
		Net::HTTP.start(uri.host, uri.port, :verify_mode => OpenSSL::SSL::VERIFY_NONE) do |http|
		  request = Net::HTTP::Get.new uri.request_uri
		  request.basic_auth username, password
		  response = http.request request
		  doc = Nokogiri::HTML(response.body)
			tables = doc.search('table')

			table = tables[1]
			skip_rows = 1
			table.search('tr').each_with_index do |row,index|
				next if index < skip_rows
				cells = row.search('th, td').map{ |cell| cell.text.strip}
				parameter = cells[0].downcase.gsub(' ','_').gsub('/','_')
			  monit_instance_params[parameter] = cells[1] if white_listed_params.include? parameter
			end
		end
		existing_monit_instance = MonitInstance.where(monit_id: monit_instance_params['monit_id'])
		if existing_monit_instance.present?
			return existing_monit_instance.first
		else
			return MonitInstance.create(monit_instance_params)