app/views/layouts/application.html.erb

                    <li class="nav-item active">
                        <a class="nav-link" target="_blank" href=<%= dashboard_user_path(User.first)%>>
---
SELECT  `users`.* FROM `users` ORDER BY `users`.`id` ASC LIMIT 1

                    <li>
                        <a class="nav-link" target="_blank" href="<%= user_path(User.first) %>">
---
SELECT  `users`.* FROM `users` ORDER BY `users`.`id` ASC LIMIT 1